from math import log2
n = int(input())
a = [] # list-ты list-тармен толтыратын боламыз
for _ in range(n):
    x, y, c = map(float, input().split())
    a.append([x, y, c])

b = float(input())

g1_0, g1_1, g2_0, g2_1 = 0, 0, 0, 0 # ga_b отвечает за количество встреч b в группе a

for i in range(n): # группаларга болемиз
    if a[i][0] < b:
        if a[i][2]==0:
            g1_0+=1
        else:
            g1_1+=1
    else:
        if a[i][2]==0:
            g2_0+=1
        else:
            g2_1+=1

p1_0, p1_1, p2_0, p2_1 = 0, 0, 0, 0 # pa_b отвечает за долю b в группе a
if(g1_0 + g1_1 > 0): # проверка чтобы не было деления на ноль
    p1_0 = g1_0/(g1_0 + g1_1)
    p1_1 = g1_1/(g1_0 + g1_1)
if(g2_0 + g2_1 > 0):
    p2_0 = g2_0/(g2_0 + g2_1)
    p2_1 = g2_1/(g2_0 + g2_1)
    
h1, h2 = 0, 0 # энтропии
if(g1_0 + g1_1 > 0): # опять проверки
    if(p1_0!=0):
        h1 -= p1_0*log2(p1_0) # формула
    if(p1_1!=0):
        h1 -= p1_1*log2(p1_1)
if(g2_0 + g2_1 > 0):
    if(p2_0!=0):
        h2 -= p2_0*log2(p2_0)
    if(p2_1!=0):
        h2 -= p2_1*log2(p2_1)
        
part1, part2 = (g1_0+g1_1)/(g1_0+g1_1+g2_0+g2_1), (g2_0+g2_1)/(g1_0+g1_1+g2_0+g2_1) # финальный расчет (шарики двух групп)
print(round(part1*h1 + part2*h2, 2)) # вывод ответа с округлением 2
